{
  "intents": [
    {
      "tag": "Greeting",
      "patterns": [
        "Hello",
        "Hi",
        "Greetings",
        "Hey",
        "Good day",
        "Howdy",
        "Salutations"
      ],
      "responses": [
        "Hello! It's great to see you.",
        "Hi there! I'm here and ready to help.",
        "Greetings! I hope you're having a wonderful day.",
        "Hey! Welcome!",
        "Good day! I'm here and ready to assist you with anything you need.",
        "Howdy! It's great to have you here.",
        "Salutations! I'm here to help.",
        "Welcome! I'm here and ready to assist you."
      ],
      "questions": [
        "How are you feeling today?",
        "How can I support you?",
        "What brings you here? Feel free to share.",
        "How can I assist you today?",
        "What's on your mind?",
        "How can I make your day better?",
        "How may I support you?",
        "What can I do for you today?"
      ]
    },
    {
      "tag": "Goodbye",
      "patterns": [
        "Goodbye",
        "Farewell",
        "See you",
        "Bye",
        "So long",
        "Take care",
        "Until next time",
        "Adieu",
        "Ciao",
        "Adios"
      ],
      "responses": [
        "Goodbye! If you ever need assistance again, feel free to reach out. Take care!",
        "Farewell! It was a pleasure assisting you. If you have more questions, don't hesitate to ask.",
        "See you! If there's anything else I can help you with, just let me know. Take care!",
        "Bye for now! Feel free to return whenever you need support. Have a great day!",
        "So long! If you ever have more inquiries, I'll be here to help. Take care!",
        "Take care! If there's anything else on your mind, don't hesitate to reach out. Goodbye!",
        "Until next time! It was great talking with you. If you need assistance, I'm here.",
        "Adieu! If there's anything else you require, feel free to ask. Take care!",
        "Ciao! If you ever want to chat again, I'll be here. Have a wonderful day!",
        "Adios! It's been a pleasure assisting you. If you have more questions, feel free to return."
      ],
      "questions": [
        "Leave the past behind and focus on today, now is your time.",
        "You're getting stronger every day, keep believing in yourself.",
        "Replace negative thoughts with positive ones, your mind is your power.",
        "Treat yourself better every day to boost your self-confidence.",
        "Focus on the positive changes in your life, even small progress matters.",
        "Recognize your own worth and act accordingly, everyone is unique and valuable."
      ]
    },
    {
      "tag": "Thanks",
      "patterns": [
        "Appreciate it",
        "Grateful",
        "Thank you",
        "Thanks",
        "Thanks a lot",
        "Many thanks",
        "Thank you very much",
        "Thanks again",
        "I appreciate your help"
      ],
      "responses": [
        "You're welcome! Thank you for reaching out!",
        "Thanks! It was my pleasure to assist you.",
        "Appreciate it! Thank you for using our services!",
        "Grateful for the opportunity to help!",
        "Thank you so much!",
        "Thanks a lot! It's always a pleasure to help.",
        "Many thanks! Thank you for choosing our service!",
        "Thank you very much! Take care and thanks for reaching out!",
        "Thanks! I appreciate your interaction!"
      ],
      "questions": [
        "If you ever have more questions, feel free to ask.",
        "I'm here to assist whenever you need.",
        "If there's anything else, don't hesitate to let me know.",
        "If you need support, I'm just a message away.",
        "Let me know how I can further assist you.",
        "If you need further support, I'm here.",
        "If there's anything else on your mind, feel free to reach out. Thank you!",
        "If you have more inquiries in the future, I'll be here to assist you. Take care!",
        "If you ever need assistance again, don't hesitate to ask.",
        "If there's anything else I can do for you, feel free to let me know.",
        "If you ever want to chat again, I'll be here.",
        "If there's anything else you require, don't hesitate to reach out.",
        "If you have more questions or concerns, I'm here to assist you."
      ]
    },
    {
      "tag": "Funny",
      "patterns": [
        "Joke",
        "Laugh",
        "Entertain",
        "Humor",
        "Smile"
      ],
      "responses": [
        "Why don't scientists trust atoms? Because they make up everything!",
        "How does a penguin build its house? Igloos it together!",
        "Why did the bicycle fall over? It was two-tired!",
        "What's orange and sounds like a parrot? A carrot!",
        "I told my wife she should embrace her mistakes. She gave me a hug.",
        "What do you call fake spaghetti? An impasta!",
        "Why don't skeletons fight each other? They don't have the guts!",
        "I only know 25 letters of the alphabet. I don't know y.",
        "What did one hat say to the other? Stay here, I'm going on ahead!",
        "Why did the scarecrow win an award? Because he was outstanding in his field!"
      ],
      "questions": [
        "Do you want another joke?",
        "Would you like some more humor?"
      ]
    },
    {
      "tag": "Depression",
      "patterns": [
        "Sadness",
        "Fatigue",
        "Isolation",
        "Lack of interest",
        "Guilt",
        "Loss of appetite",
        "Persistent low mood",
        "Decreased energy",
        "Difficulty concentrating",
        "Changes in weight"
      ],
      "responses": [
        "I'm sorry to hear that you're experiencing such deep sadness. It's important to recognize that you're not alone in this.",
        "Feelings of hopelessness can be overwhelming, but it's crucial to understand that there is help available.",
        "Fatigue and sleep disturbances are common in depression. Establishing a healthy routine and incorporating self-care practices can significantly impact your energy levels and overall well-being.",
        "Isolation is a common symptom of depression, and connecting with others is an important step in the healing process.",
        "Lack of interest in activities is a key aspect of depression."
      ],
      "questions": [
        "Let's work on identifying activities that bring you joy and purpose, helping you rediscover a sense of fulfillment and engagement in your daily life.",
        "We can explore ways to build a support system and enhance your social interactions to improve your mental health",
        "Let's discuss personalized strategies for you.",
        "Together, we can work on coping mechanisms and therapeutic approaches to bring about positive changes in your life.",
        "Let's explore strategies together to navigate through these difficult emotions and find a path towards healing."
      ]
    },
    {
      "tag": "Social Anxiety Disorder",
      "patterns": [
        "Social situations",
        "Fear of judgment",
        "Performance anxiety",
        "Avoidance behavior",
        "Blushing",
        "Trembling",
        "Sweating",
        "Nervousness",
        "Negative self-perception",
        "Excessive self-consciousness",
        "Difficulty speaking in public",
        "Fear of embarrassment",
        "Isolation in social settings",
        "Self-isolation",
        "Overanalyzing social interactions"
      ],
      "responses": [
        "Navigating social situations can be challenging, especially when dealing with the fear of judgment.",
        "Performance anxiety and the fear of embarrassment are common aspects of social anxiety.",
        "Avoidance behavior in social situations is understandable, but it's important to address these challenges.",
        "Physical symptoms like blushing and trembling are part of social anxiety.",
        "Negative self-perception often accompanies social anxiety."
      ],
      "questions": [
        "I'm here to help you explore techniques to manage anxiety and build confidence in various social settings.",
        "Together, we can work on strategies to challenge negative thoughts, enhance self-esteem, and gradually expose yourself to social interactions.",
        "Let's develop a step-by-step plan to gradually face and overcome the anxiety associated with social interactions.",
        "Let's explore these strategies together.",
        "Understanding these reactions and learning coping mechanisms can empower you to navigate social situations with greater ease.",
        "Through therapy, we can work on reframing negative thoughts, fostering self-compassion, and building a more positive self-image to improve your overall well-being."
      ]
    },
    {
      "tag": "Obsessive-Compulsive Disorder",
      "patterns": [
        "Intrusive thoughts",
        "Compulsive rituals",
        "Anxiety provoking obsessions",
        "Fear of contamination",
        "Checking behaviors",
        "Counting rituals",
        "Washing compulsions",
        "Hoarding tendencies",
        "Symmetry concerns",
        "Doubting thoughts",
        "Mental rituals",
        "Perfectionism",
        "Distress",
        "Time-consuming rituals"
      ],
      "responses": [
        "I understand that intrusive thoughts and compulsive rituals can be distressing.",
        "The fear of contamination and washing compulsions are common in OCD.",
        "Counting rituals and symmetry concerns can become consuming. ",
        "Hoarding tendencies and the emotional distress they bring can be challenging.",
        "Perfectionism and doubt are integral to OCD."
      ],
      "questions": [
        "Let's work together to identify triggers, develop coping strategies, and gradually reduce the impact of these obsessions and compulsions on your daily life.",
        "We can explore exposure and response prevention techniques to help you gradually face and overcome these fears, promoting a healthier relationship with daily activities.",
        "In therapy, we can address these behaviors and work towards establishing a more balanced and manageable approach to daily routines.",
        "Let's develop strategies to declutter, prioritize, and manage these tendencies to create a more organized and comfortable living space.",
        "Together, we can explore self-acceptance, challenge unrealistic standards, and develop a more balanced perspective, fostering a sense of calm and fulfillment in your life."
      ]
    },
    {
      "tag": "Schizophrenia",
      "patterns": [
        "Hallucinations",
        "Delusions",
        "Disorganized thinking",
        "Impaired memory",
        "Emotional flatness",
        "Lack of motivation",
        "Paranoia",
        "Incoherent speech",
        "Lack of insight",
        "Apathy",
        "Cognitive deficits",
        "Impaired decision-making"
      ],
      "responses": [
        "Hallucinations and delusions can be distressing experiences.",
        "Disorganized thinking and impaired memory can impact daily functioning.",
        "Social withdrawal and emotional flatness are common in schizophrenia.",
        "Paranoia and incoherent speech can create challenges in communication.",
        "Cognitive deficits and impaired decision-making are aspects of schizophrenia that can be addressed through targeted interventions."
      ],
      "questions": [
        "In therapy, we can work on understanding and managing these symptoms, fostering a sense of control and stability in your life.",
        "Let's explore cognitive strategies and coping mechanisms to enhance your cognitive abilities and improve your overall quality of life.",
        "Together, we can develop social skills and emotional regulation techniques to improve your interpersonal relationships and emotional well-being.",
        "Through therapy, we can work on building trust, improving communication skills, and addressing the underlying causes of paranoia.",
        "Let's work together to enhance your cognitive functioning and decision-making abilities for a more fulfilling life."
      ]
    },
    {
      "tag": "Bipolar Disorder",
      "patterns": [
        "Manic episodes",
        "Depressive episodes",
        "Mood swings",
        "Elevated mood",
        "Grandiosity",
        "Increased energy",
        "Impulsivity",
        "Sleep disturbances",
        "Racing thoughts",
        "Rapid speech"
      ],
      "responses": [
        "Experiencing manic episodes can be intense.",
        "Managing depressive episodes is crucial.",
        "Mood swings are a challenging aspect of bipolar disorder.",
        "Increased energy and impulsivity during manic episodes can impact daily life.",
        "Sleep disturbances often accompany bipolar disorder. Developing healthy sleep hygiene habits and exploring relaxation techniques can contribute to mood stability."
      ],
      "questions": [
        "Let's work together to understand the patterns, manage impulsivity, and establish strategies to maintain stability during these periods.",
        "Together, we can explore coping mechanisms, develop a support plan, and work towards restoring a sense of hope and motivation in your life.",
        "Let's identify triggers, establish routines, and explore lifestyle changes to help stabilize your mood and improve overall well-being.",
        "Let's collaborate on strategies to channel this energy positively and minimize potential risks.",
        "Let's create a personalized plan for you."
      ]
    },
    {
      "tag": "Eating Disorders",
      "patterns": [
        "Anoreksiya nervoza",
        "Bulimia nervoza",
        "Binge eating",
        "Excessive exercise",
        "Body image distortion",
        "Restrictive eating",
        "Purging behaviors",
        "Fear of weight gain",
        "Obsession with food and weight",
        "Emotional eating",
        "Preoccupation with dieting",
        "Distorted self-perception",
        "Hoarding food",
        "Socio-cultural influences"
      ],
      "responses": [
        "Anoreksiya nervoza and restrictive eating patterns can be physically and emotionally challenging.",
        "Bulimia nervoza and purging behaviors can impact both physical and mental well-being.",
        "Binge eating is a common aspect of eating disorders.",
        "Excessive exercise and its impact on overall health is a concern in eating disorders.",
        "Body image distortion is often a central issue."
      ],
      "questions": [
        "Let's explore balanced nutrition, coping mechanisms, and self-acceptance to promote a healthier relationship with food.",
        "Together, we can work on breaking the cycle, addressing emotional triggers, and establishing healthier coping strategies.",
        "Developing mindful eating habits, identifying triggers, and managing emotions can contribute to a more balanced approach to food.",
        "Let's discuss healthy exercise habits and explore alternatives to excessive physical activity to support your well-being.",
        "Through therapy, we can work on building a more positive self-perception and addressing societal influences that may contribute to negative body image."
      ]
    },
    {
      "tag": "Post-Traumatic Stress Disorder",
      "patterns": [
        "Traumatic event",
        "Flashbacks",
        "Nightmares",
        "Hypervigilance",
        "Avoidance",
        "Emotional numbness",
        "Anxiety",
        "Fear of triggers",
        "Guilt and shame"
      ],
      "responses": [
        "Experiencing flashbacks and nightmares after a traumatic event is challenging.",
        "Hypervigilance and anxiety are common in PTSD.",
        "Avoidance is a coping mechanism, but it can limit your life.",
        "Emotional numbness can be isolating.",
        "Guilt and shame are common emotional responses to trauma."
      ],
      "questions": [
        "Let's work on grounding techniques, coping mechanisms, and creating a safe space for you to process and heal.",
        "We can explore relaxation exercises, mindfulness, and gradual exposure to help you regain a sense of safety and control in your daily life.",
        "Together, we can work on facing triggers in a controlled way, building resilience, and gradually reducing the impact of trauma on your day-to-day experiences.",
        "Let's explore ways to reconnect with your emotions, express yourself, and foster a sense of connection with others.",
        "Through therapy, we can work on self-compassion, understanding the impact of trauma, and developing strategies for healing and recovery."
      ]
    },
    {
      "tag": "Attention Deficit Hyperactivity Disorder",
      "patterns": [
        "Inattention",
        "Hyperactivity",
        "Difficulty focusing",
        "Forgetfulness",
        "Restlessness",
        "Poor time management",
        "Difficulty organizing tasks",
        "Fidgeting",
        "Impulsive decision-making",
        "Interrupting others",
        "Lack of attention to details",
        "Difficulty sustaining attention",
        "Excessive talking",
        "Difficulty waiting turn"
      ],
      "responses": [
        "Managing inattention and difficulty focusing is a common challenge in ADHD.",
        "Hyperactivity and restlessness can impact daily life.",
        "Impulsivity and impulsive decision-making are aspects of ADHD.",
        "Poor time management is a common concern.",
        "Interrupting others and excessive talking can be challenging."
      ],
      "questions": [
        "Let's explore organizational strategies, time management techniques, and personalized approaches to enhance your focus.",
        "Together, we can work on channeling excess energy, incorporating regular breaks, and developing coping strategies to manage restlessness.",
        "Let's work on mindfulness techniques, impulse control strategies, and decision-making skills to promote more intentional actions.",
        "Through therapy, we can establish routines, prioritize tasks, and develop strategies to improve your ability to manage time effectively.",
        "Let's explore communication techniques, active listening skills, and strategies to enhance social interactions while managing ADHD symptoms."
      ]
    },
    {
      "tag": "Personality Disorders",
      "patterns": [
        "Paranoid",
        "Narcissistic",
        "Borderline",
        "Antisocial",
        "Histrionic",
        "Avoidant",
        "Dependent",
        "Schizoid",
        "Schizotypal",
        "Emotional instability",
        "Impaired interpersonal relationships",
        "Fear of abandonment",
        "Lack of empathy",
        "Rigidity in thinking"
      ],
      "responses": [
        "Paranoid personality disorder may involve distrust and suspicion.",
        "Narcissistic personality disorder may impact interpersonal dynamics.",
        "Borderline personality disorder often involves emotional instability and fear of abandonment.",
        "Antisocial personality disorder may lead to challenges in forming connections.",
        "Histrionic personality disorder may involve attention-seeking behaviors."
      ],
      "questions": [
        "In therapy, we can explore building trust, developing coping mechanisms, and enhancing your ability to form healthy relationships.",
        "Let's work on empathy-building exercises, communication skills, and strategies for fostering more meaningful connections.",
        "In therapy, we can focus on emotional regulation, building a strong sense of self, and developing healthier coping mechanisms.",
        "Let's explore prosocial behaviors, communication skills, and strategies for building positive relationships with others.",
        "In therapy, we can explore more adaptive ways to express yourself, build self-esteem, and cultivate meaningful connections."
      ]
    },
    {
      "tag": "Somatization Disorder",
      "patterns": [
        "Somatic symptoms",
        "Chronic pain",
        "Multiple physical complaints",
        "Excessive worry about health",
        "Doctor-shopping",
        "Functional impairment",
        "Anxiety about symptoms",
        "Preoccupation with illness",
        "Frequent medical visits",
        "Misattributing physical sensations",
        "Unexplained medical tests",
        "Relationship difficulties",
        "Emotional distress",
        "Seeking reassurance",
        "Impaired quality of life"
      ],
      "responses": [
        "Experiencing somatic symptoms can be distressing.",
        "Chronic pain and multiple physical complaints can impact daily life.",
        "Excessive worry about health and doctor-shopping are common in somatization disorder.",
        "Preoccupation with illness and misattributing physical sensations can affect your daily functioning.",
        "Relationship difficulties and seeking reassurance may be intertwined with somatization disorder."
      ],
      "questions": [
        "Let's explore the connection between emotions and physical sensations, develop coping strategies, and work towards improving your overall well-being.",
        "In therapy, we can work on pain management techniques, mindfulness, and addressing the underlying emotional factors contributing to your symptoms.",
        "Let's explore ways to manage health-related anxiety, foster a trusting relationship with healthcare providers, and reduce the frequency of medical visits.",
        "Together, we can work on reframing thoughts, addressing emotional distress, and improving your ability to cope with these concerns.",
        "In therapy, we can explore communication skills, build a support system, and address the impact of these challenges on your relationships."
      ]
    },
    {
      "tag": "Panic Disorder",
      "patterns": [
        "Panic attacks",
        "Sudden fear",
        "Rapid heartbeat",
        "Chest pain",
        "Shortness of breath",
        "Trembling or shaking",
        "Dizziness",
        "Nausea or stomach distress",
        "Fear of losing control",
        "Fear of death",
        "Hyperventilation",
        "Tunnel vision",
        "Feelings of unreality"
      ],
      "responses": [
        "Experiencing panic attacks can be overwhelming.",
        "Sudden fear and physical symptoms like rapid heartbeat can be distressing.",
        "Chest pain and shortness of breath during panic attacks can be alarming.",
        "Avoidance behaviors may develop as a result of panic attacks.",
        "Feelings of unreality can accompany panic attacks."
      ],
      "questions": [
        "Let's work on identifying triggers, implementing relaxation techniques, and developing coping strategies to manage and reduce the intensity of panic episodes.",
        "Through therapy, we can explore the root causes of your panic attacks, develop grounding exercises, and work towards building resilience.",
        "Let's address these physical symptoms, explore ways to manage anxiety, and develop a personalized plan to navigate through panic episodes.",
        "In therapy, we can work on gradual exposure techniques, challenge negative thought patterns, and develop strategies to face and overcome situations that trigger anxiety.",
        "Let's explore techniques to ground yourself in the present moment, address cognitive distortions, and work towards reducing the impact of panic disorder on your daily life."
      ]
    },
    {
      "tag": "Major Depressive Disorder",
      "patterns": [
        "Loss of interest",
        "Changes in appetite",
        "Feelings of worthlessness",
        "Suicidal thoughts",
        "Social withdrawal",
        "Irritability",
        "Anhedonia",
        "Persistent sadness",
        "Psychomotor agitation or retardation",
        "Hopelessness"
      ],
      "responses": [
        "Experiencing panic attacks can be overwhelming.",
        "Sudden fear and physical symptoms like rapid heartbeat can be distressing.",
        "Chest pain and shortness of breath during panic attacks can be alarming.",
        "Avoidance behaviors may develop as a result of panic attacks.",
        "Feelings of unreality can accompany panic attacks."
      ],
      "questions": [
        "Let's work on identifying triggers, implementing relaxation techniques, and developing coping strategies to manage and reduce the intensity of panic episodes.",
        "Through therapy, we can explore the root causes of your panic attacks, develop grounding exercises, and work towards building resilience.",
        "Let's address these physical symptoms, explore ways to manage anxiety, and develop a personalized plan to navigate through panic episodes.",
        "In therapy, we can work on gradual exposure techniques, challenge negative thought patterns, and develop strategies to face and overcome situations that trigger anxiety.",
        "Let's explore techniques to ground yourself in the present moment, address cognitive distortions, and work towards reducing the impact of panic disorder on your daily life."
      ]
    },
    {
      "tag": "Alcohol and Substance Use Disorders",
      "patterns": [
        "Substance abuse",
        "Dependence",
        "Withdrawal symptoms",
        "Tolerance",
        "Cravings",
        "Social isolation",
        "Legal issues",
        "Occupational impairment",
        "Family conflicts",
        "Escalating use",
        "Failed attempts to quit",
        "Risky behaviors",
        "Physical health problems",
        "Denial of the problem"
      ],
      "responses": [
        "Substance abuse and dependence can have a significant impact on various aspects of your life.",
        "Withdrawal symptoms and cravings can be challenging to manage.",
        "Social isolation and family conflicts often accompany substance use disorders.",
        "Escalating use and failed attempts to quit can be discouraging.",
        "Denial of the problem is a common barrier to seeking help."
      ],
      "questions": [
        "Let's explore coping mechanisms, set realistic goals, and work towards creating a healthier lifestyle.",
        "In therapy, we can develop strategies to navigate these urges, address triggers, and foster resilience in your journey to recovery.",
        "Let's work on rebuilding connections, improving communication, and developing a support system to enhance your overall well-being.",
        "Together, we can explore the underlying factors, identify alternative coping strategies, and create a personalized plan for achieving and maintaining sobriety.",
        "In therapy, we can work on increasing awareness, fostering motivation for change, and addressing any ambivalence towards recovery."
      ]
    },
    {
      "tag": "Family Relationships and Marital Problems",
      "patterns": [
        "Communication breakdown",
        "Conflict resolution",
        "Lack of intimacy",
        "Trust issues",
        "Parenting conflicts",
        "Emotional distance",
        "Financial stress",
        "Role expectations",
        "Loss of connection",
        "Resentment",
        "Coping with life changes",
        "Blended family challenges"
      ],
      "responses": [
        "Communication breakdown can strain relationships.",
        "Conflict resolution is crucial for a healthy relationship.",
        "Lack of intimacy can lead to emotional distance.",
        "Trust issues and infidelity are challenging to navigate.",
        "Parenting conflicts and financial stress can impact your marriage."
      ],
      "questions": [
        "Let's work on effective communication strategies, active listening, and fostering a safe space for open dialogue in your marriage.",
        "In therapy, we can explore techniques to address conflicts constructively, understand each other's perspectives, and strengthen your problem-solving skills.",
        "Let's explore ways to reignite connection, improve emotional intimacy, and foster a more fulfilling relationship.",
        "In therapy, we can address the root causes, rebuild trust, and work towards healing the emotional wounds in your relationship.",
        "Let's develop a collaborative parenting approach, explore financial management strategies, and strengthen your partnership in facing challenges."
      ]
    },
    {
      "tag": "Relationship Issues",
      "patterns": [
        "Communication difficulties",
        "Misunderstandings",
        "Lack of quality time",
        "Different values",
        "Unmet expectations",
        "Intimacy concerns",
        "Power struggles",
        "Jealousy",
        "Fear of commitment",
        "Insecurity",
        "Infidelity",
        "Coping with change"
      ],
      "responses": [
        "Communication difficulties can strain relationships.",
        "Trust issues are common in relationships.",
        "Misunderstandings can lead to conflict.",
        "Emotional distance can be challenging.",
        "Lack of quality time can impact closeness."
      ],
      "questions": [
        "In therapy, we can work on improving communication skills, active listening, and fostering an open and understanding dialogue between you and your partner.",
        "Let's explore the root causes, establish trust-building exercises, and work towards rebuilding a foundation of trust and security in your relationship.",
        "Together, we can explore effective communication strategies, clarify intentions, and develop tools for navigating disagreements in a healthy way.",
        "Let's explore ways to reconnect, improve emotional intimacy, and create a space for vulnerability and open expression within your relationship.",
        "Let's work on time management, prioritize shared activities, and create opportunities for meaningful connection in your relationship."
      ]
    }
  ]
}
